import MaxWidthWrapper from "@/components/MaxWidthWrapper";
import React from "react";

const termsConditions: Array<string | { title: string; items: string[] }> = [
  "Official Warranty সম্বলিত Accessories (Smart Watch, AirPods, Power Adapter, Cable, Bluetooth Speaker ইত্যাদি) এর ওয়ারেন্টি Claim এর ক্ষেত্রে বক্স এবং ওয়ারেন্টি স্টিকার সংরক্ষণ করা বাধ্যতামূলক। এক্ষেত্রে ওয়ারেন্টি ক্লেইম করতে ৩ থেকে ৪৫ কর্মদিবস পর্যন্ত সময় প্রয়োজন হতে পারে.",
  "শুধুমাত্র Non-Warranty প্রোডাক্টের ক্ষেত্রে ৩ দিনের ওয়ারেন্টি প্রযোজ্য। (প্রোডাক্ট এর ডিসপ্লে / টাচ ইস্যু, লিকুইড ড্যামেজ, ফিজিক্যাল ড্যামেজ, প্রোডাক্টের বক্স ড্যামেজ ব্যতীত)",
  "Samsung এর Watch, Buds এবং Apple Watch, AirPods, Pencil, Mouse, Keyboard (Apple 1 Year Warranty ব্যতীত Products) এর জন্য ১০ দিনের Repair Warranty প্রযোজ্য। (এর ডিসপ্লে / টাচ ইস্যু, লিকুইড ড্যামেজ, ফিজিক্যাল ড্যামেজ, প্রোডাক্টের বক্স ড্যামেজ ব্যতীত। মহামারী ও বিশেষ জটিলতার কারণে Warranty Claim এর ক্ষেত্রে ৩ থেকে সর্বোচ্চ ৪৫ কর্মদিবস পর্যন্ত সময় প্রয়োজন হতে পারে)",
  {
    title: "বিশেষ দ্রষ্টব্যঃ",
    items: [
      "নিম্নোক্ত শর্তসমূহ ডিভাইস এবং এক্সেসরিজ উভয় ক্ষেত্রে প্রযোজ্য",
      "বিক্রিত পণ্য অফেরতযোগ্য। ক্রয়কৃত ডিভাইসে কোন দৃশ্যমান সমস্যা না পাওয়া গেলে অথবা কোন কারণে পছন্দ না হলে Apple Gadgets এর এক্সচেঞ্জ পলিসি অনুযায়ী এক্সচেঞ্জ করতে পারবেন। কোন ভাবেই ক্রয়কৃত ডিভাইস পরিবর্তন করে অন্য প্রোডাক্ট নেয়া যাবে না.",
      "একই পণ্য বিভিন্ন Sales Region ভিত্তিক ভিন্ন ভিন্ন সফটওয়্যার রেস্ট্রিকশন অথবা Hardware Change থাকতে পারে এবং Production Batch-এর ভিন্নতার কারণে আপনার পূর্বে ব্যবহৃত পণ্যটির সাথে নতুন পণ্যটির কিছুটা তারতম্য হতে পারে যেমন: ফিটিংস / ডিসপ্লে রং / হেডফোনের সাউন্ড কোয়ালিটি / প্যাকেজিং ইত্যাদি। এই সকল ঘটনা ওয়ারেন্টি রিপ্লেসমেন্ট আওতাভুক্ত হবে না.",
      "ওয়ারেন্টি যুক্ত প্রোডাক্ট নির্দিষ্ট সময়ের মধ্যে সমস্যার সমাধান করে দেওয়া হবে। যদি কোন প্রোডাক্ট সমাধান এর অযোগ্য হয় শুধুমাত্র সেই ক্ষেত্রে প্রোডাক্ট রিপ্লেস করে দেওয়া হবে.",
      "রিপ্লেসমেন্ট ওয়ারেন্টি শুধুমাত্র একবারের জন্যই প্রযোজ্য। তবে সে ক্ষেত্রে (স্ক্র্যাচ/ত্রুটি/কালার/এক্সেসরিজ ও বক্স) সব অক্ষত থাকা বাধ্যতামূলক.",
      "কিছু কিছু ব্র্যান্ডের ক্ষেত্রে ক্রেতাকে উক্ত ব্র্যান্ডের নিজস্ব ওয়ারেন্টি পলিসি অনুযায়ী তাদের নিজস্ব অফিসিয়াল সার্ভিস সেন্টারে গিয়ে সকল ওয়ারেন্টি সুবিধা নিতে হবে, যেমন : Edifier & এ জাতীয় প্রোডাক্ট Apple Gadgets এর মাধ্যমে Warranty Claim করাতে হলে অবশ্যই গ্রাহককে অধিকতর বেশী সময় প্রদান করতে হবে.",
      "কুরিয়ারের মাধ্যমে নেওয়া প্রোডাক্ট এ যদি কোন ত্রুটি দেখা যায়, তবে পণ্যটি ব্যবহার না করে Warranty Claim করার জন্য অবশ্যই অর্ডারটি রিসিভের দিনই / ২৪ ঘন্টার মধ্যে আমাদের কাস্টমার সাপোর্টে জানাতে হবে। (+8801810023526)",
      "কুরিয়ারের মাধ্যমে পণ্য কিনলে Unboxing ভিডিও অবশ্যই Apple Gadgets এর নিজস্ব বক্স/স্টিকার খোলা থেকে শুরু করতে হবে, এবং প্রোডাক্ট সঠিকভাবে কাজ করে কিনা তা বুঝার সুবিধার্থে Unboxing থেকে Connection পর্যন্ত ভিডিও করার জন্য অনুরোধ করা যাচ্ছে। যেন কোনো ত্রুটি দেখা দিলে ভবিষ্যতে প্রমাণ হিসাবে উপস্থাপন করা যায়.",
      "ওয়ারেন্টি এর সময় অতিক্রম হওয়ার পর কোন প্রকার ওয়ারেন্টি ক্লেইম গ্রহনযোগ্য হবে না.",
      "যেকোনো প্রকার রিফান্ড ৩ (তিন) কর্মদিবসের মধ্যে প্রসেসিং করা হবে। খেয়াল করুন, রিফান্ড দেয়ার মাধ্যম (ব্যাংক ট্রান্সফার/ মোবাইল ব্যাংকিং) Apple Gadgets কর্তৃক ঠিক করা হবে.",
      "যেকোনো সময় পূর্বের কোনো ঘোষণা ছাড়াই Apple Gadgets যেকোনো পলিসি পরিবর্তন/পরিমার্জন/পরিবর্ধন করার ক্ষমতা রাখে.",
      "যে কোন প্রোডাক্ট Warranty Claim করতে ইনভয়েস/বিল ও বক্সের ওয়ারেন্টি স্টিকার সহ স্বশরীরে আমাদের কাস্টমার কেয়ারে আসতে হবে.",
      "Warranty Claim করার জন্য মহামারী ও বিশেষ জটিলতার কারণে ৩ থেকে ৪৫ কর্মদিবস প্রয়োজন হতে পারে.",
    ],
  },
];

const TermsConditionPage: React.FC = () => {
  return (
    <section className="my-6 md:my-10">
      <MaxWidthWrapper>
        <h2 className="text-xl font-bold">
          Terms & Conditions of Warranty Claim for Smart Devices
        </h2>
        <ul className="list-disc ml-5 space-y-4 mt-4">
          {termsConditions.map((item, index) => {
            if (typeof item === "string") {
              return <li key={index}>{item}</li>;
            } else {
              return (
                <div key={index}>
                  <h3 className="text-lg font-semibold mt-4">{item.title}</h3>
                  <ul className="list-disc ml-5 space-y-4">
                    {item.items.map((subItem, subIndex) => (
                      <li key={subIndex}>{subItem}</li>
                    ))}
                  </ul>
                </div>
              );
            }
          })}
        </ul>
        <p className="mt-6">
          উপরে বর্ণিত সকল নিয়ম নীতি সম্পর্কে অবগত হয়ে Apple Gadgets হতে পণ্য
          ক্রয় করলাম।
        </p>
      </MaxWidthWrapper>
    </section>
  );
};

export default TermsConditionPage;
